import React from 'react';
import { StyleSheet, Text, ActivityIndicator, View, SectionList, TouchableOpacity } from 'react-native';
import Constants from 'expo-constants';
import * as firebase from 'firebase';

a = [];
b = 0;
aa = []
export default class App extends React.Component {
    constructor() {
        super();
        console.ignoredYellowBox = [
            'Setting a timer'
        ];
        this.state = {
        };
    }
    componentWillMount() {
        a = [];
        b = 0;
        aa = [];
        /////////add array doc///////////////////////////////.where("ok", "==", true)
        const dbh = firebase.firestore();
        dbh.collection("/Project/work/first").where("status", "==", "0").get().then(function (querySnapshot) {
            querySnapshot.forEach(function (doc) {
                a[b] = doc.id;
                aa[b] = { title: doc.id, data: [] };
                b = b + 1;
            });
        });

        ///add data///////////////////////////////////
        setTimeout(() => {
            const dbh = firebase.firestore();

            if (aa.length != 0) {
                for (let index = 0; index < aa.length; index++) {
                    c = "";
                    ag1 = "";
                    ag2 = "";
                    var docRef = dbh.collection("/Project/work/first").doc(aa[index].title);
                    docRef.get().then(function(doc) {
                        c = doc.data().call;
                        if (c == "F1_1") { ag1 = "รถสตาร์ทไม่ติด / สตาร์มติดยาก"; ag2 = "แบตเตอรี่ไฟไม่พอ"; };
                        if (c == "F1_2") { ag1 = "รถสตาร์ทไม่ติด / สตาร์มติดยาก"; ag2 = "น้ำกลั่นในแบตเตอรี่หมด"; };
                        if (c == "F1_3") { ag1 = "รถสตาร์ทไม่ติด / สตาร์มติดยาก"; ag2 = "สัญลักษณ์รูปแบตเตอรี่ขึ้นโชว์"; };
                        if (c == "F1_4") { ag1 = "รถสตาร์ทไม่ติด / สตาร์มติดยาก"; ag2 = "แบตเตอรี่เสื่อมสภาพ"; };
                        if (c == "F1_5") { ag1 = "รถสตาร์ทไม่ติด / สตาร์มติดยาก"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F2_1") { ag1 = " รถสตาร์ทติด แต่เครื่องยนต์ไม่ทำงาน"; ag2 = "เข็มบอกระดับน้ำมันค้าง"; };
                        if (c == "F2_2") { ag1 = " รถสตาร์ทติด แต่เครื่องยนต์ไม่ทำงาน"; ag2 = "ตัวกรองเบนซินมีปัญหา"; };
                        if (c == "F2_3") { ag1 = " รถสตาร์ทติด แต่เครื่องยนต์ไม่ทำงาน"; ag2 = "จานจ่ายไฟมีปัญหา"; };
                        if (c == "F2_4") { ag1 = " รถสตาร์ทติด แต่เครื่องยนต์ไม่ทำงาน"; ag2 = "สายพานหน้าเครื่องมีปัญหา"; };
                        if (c == "F2_5") { ag1 = " รถสตาร์ทติด แต่เครื่องยนต์ไม่ทำงาน"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F3_1") { ag1 = "เครื่องยนต์เตือนไฟความร้อนขึ้น"; ag2 = "พัดลมระบายความร้อนเสีย"; };
                        if (c == "F3_2") { ag1 = "เครื่องยนต์เตือนไฟความร้อนขึ้น"; ag2 = "ตัว Sensor วัดความร้อนเสีย"; };
                        if (c == "F3_3") { ag1 = "เครื่องยนต์เตือนไฟความร้อนขึ้น"; ag2 = "ตัว Relay พัดลมหม้อน้ำเสีย"; };
                        if (c == "F3_4") { ag1 = "เครื่องยนต์เตือนไฟความร้อนขึ้น"; ag2 = "ประเก็นฝาสูบมีปัญหา"; };
                        if (c == "F3_5") { ag1 = "เครื่องยนต์เตือนไฟความร้อนขึ้น"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F4_1") { ag1 = "เครื่องยนต์เร่งไม่ขึ้น / เครื่องยนต์ไม่มีกำลัง"; ag2 = "หัวเทียนบอด / เสีย"; };
                        if (c == "F4_2") { ag1 = "เครื่องยนต์เร่งไม่ขึ้น / เครื่องยนต์ไม่มีกำลัง"; ag2 = "ประเก็นฝาสูบมีปัญหา"; };
                        if (c == "F4_3") { ag1 = "เครื่องยนต์เร่งไม่ขึ้น / เครื่องยนต์ไม่มีกำลัง"; ag2 = "สายพรานหย่อน / ชำรุด"; };
                        if (c == "F4_4") { ag1 = "เครื่องยนต์เร่งไม่ขึ้น / เครื่องยนต์ไม่มีกำลัง"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F5_1") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "มีเสียงแปลกๆ เกิดขึ้น"; };
                        if (c == "F5_2") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "ผ้าเบรคหมด"; };
                        if (c == "F5_3") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "เหยียบเบรคไม่ลง"; };
                        if (c == "F5_4") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "น้ำมันเบรคหมด / ลดลง"; };
                        if (c == "F5_5") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "เบรคไม่อยู่"; };
                        if (c == "F5_6") { ag1 = "ระบบเบรคมีปัญหา"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F6_1") { ag1 = "มีเสียงดังแปลกๆ เกิดขึ้น"; ag2 = "มีเสียงดังเกิดขึ้นที่ล้อ"; };
                        if (c == "F6_2") { ag1 = "มีเสียงดังแปลกๆ เกิดขึ้น"; ag2 = "โช้คมีปัญหา"; };
                        if (c == "F6_3") { ag1 = "มีเสียงดังแปลกๆ เกิดขึ้น"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F7_1") { ag1 = "มีน้ำมัน / น้ำหยดลงบนพื้น"; ag2 = "กาน้ำมีปัญหา"; };
                        if (c == "F7_2") { ag1 = "มีน้ำมัน / น้ำหยดลงบนพื้น"; ag2 = "ปั๊มน้ำมีปัญหา"; };
                        if (c == "F7_3") { ag1 = "มีน้ำมัน / น้ำหยดลงบนพื้น"; ag2 = "ระบบท่อยางมีปัญหา"; };
                        if (c == "F7_4") { ag1 = "มีน้ำมัน / น้ำหยดลงบนพื้น"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F8_1") { ag1 = "เกิดปัญหาบริเวณช่วงล่าง"; ag2 = "ยางล้อรถหุบเข้า - เบนออก"; };
                        if (c == "F8_2") { ag1 = "เกิดปัญหาบริเวณช่วงล่าง"; ag2 = "ยางล้อรถซ้าย - ขวาไม่เท่ากัน"; };
                        if (c == "F8_3") { ag1 = "เกิดปัญหาบริเวณช่วงล่าง"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };
                        if (c == "F9_1") { ag1 = "มีควันสีขาวลอยออกมา"; ag2 = "เติมน้ำมันผิดประเภท"; };
                        if (c == "F9_2") { ag1 = "มีควันสีขาวลอยออกมา"; ag2 = "มีควันสีขาวออกมาอย่างเดียว"; };
                        if (c == "F9_3") { ag1 = "มีควันสีขาวลอยออกมา"; ag2 = "ไม่ทราบสาเหตุ ต้องการสอบถามช่าง"; };

                        aa[index] = { title: aa[index].title, data: [ag1, ag2] };
                        // Alert.alert(c)
                    });
                }
            }
        }, 2500);


        setTimeout(() => {
            this.props.navigation.navigate('Job', { aa: aa })
        }, 4000);
    }
    render() {
        return (
            <View style={{ flex: 1, backgroundColor: "#eeddc1", justifyContent: "center" }}>
                <ActivityIndicator size="large" color="#0000ff" />
            </View>
        )
    }
}